'''

Завдання 1
Напишіть програму, яка запитує два цілих числа x і y, після чого обчислює і виводить значення x у степені y.
Завдання 2
Підрахувати кількість цілих чисел у діапазоні від 100 до 999, у яких є дві однакові цифри.
Завдання 3
Підрахувати кількість цілих чисел у діапазоні від 100 до 9999, у яких усі цифри різні.
Завдання 4
Користувач вводить будь-яке ціле число. Необхідно з цього цілого числа видалити всі цифри 3 і 6 і вивести назад на екран.



a = int(input('шестизначне число'))

b = (a % 10)
c = ((a //10 )% 10)
d = (((a // 10) //10) % 10)
e = ((((a // 10) // 10) // 10 ) % 10)
f = (((((a // 10) // 10) // 10 ) // 10) % 10)
g = ((((((a // 10) // 10) // 10) // 10) // 10) % 10)

if a < 99999 or a > 1000000:
    print('NOT CORRECT!!!')
elif g + f + e == d + c + b:
    print('Щасливе')
else:
    print('Нещасливе')


'''


'''

1

a = int(input('Число'))
b = int(input('Степень:'))

print(a ** b)
'''

'''

2

correctnumbers = 0
for i in range(100, 999):
    b = (i % 10)
    c = ((i //10 )% 10)
    d = (((i // 10) //10) % 10)
    if b == c or c == d or b == d:
        correctnumbers += 1
print(correctnumbers)

'''

'''

3

correctnumbers = 0
for i in range(100, 9999):
    b = (i % 10)
    c = ((i // 10) % 10)
    d = (((i // 10) // 10) % 10)
    e = ((((i // 10) // 10) // 10) % 10)
    if not b == c and not c == d and not d == e:
        correctnumbers += 1
print(correctnumbers)
'''
'''
4 

1 варіант

a = int(input('число'))
a1 = 0
b = str(a)
b1 = len(b)



for i in range(1, b1 + 1):
    c = ((a // 10 ** (b1 - i)) % 10)
    if c == 3 or c == 6:
        print(' ', end='')
    else:
        print(c, end='')



2 варіант

a = int(input('число'))
a1 = 0
b = str(a)
b1 = len(b)


for i in range(1, b1 + 1):
    c = ((a // 10 ** (b1 - i)) % 10)
    if not c == 3 and not c == 6:
        print(c, end='')
'''